{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"0a83bb9b-5021-57b5-837a-2d737026eb24","html":"<h2>Geographical features</h2>\n<p>China is located in East Asia. To the east of China, there's South China sea and the Pacific Ocean. In the west, China is bounded by the mountains, the Himalayas, and by the Taklamakan Desert. In the north, there's Gobi Desert, by the Yellow (Huang) River.</p>\n<hr>\n<p>China proper, Inner China was a term used by Western writers on the Manchu Qing dynasty to express a distinction between the core and frontier regions of China.</p>\n<p>Sub-regions of China proper:</p>\n<h3>1. North China Plain</h3>\n<p>Vast expensive farmlands. Very easy to travel. It used to be warm, wet region, but after years of flying, it became dry. It is here, where the first Chinese communities originated. Today, the north China Plain is where most of the people are.</p>\n<h3>2. South China</h3>\n<p>Located South of Yahtzee (?) River. South china is very different from North China Plain. Region is mountaneous in contrast to North China. The lowlands along the Yahtzee (?) river divided into farmlands and settlements.</p>\n<h3>3. Sichuan Basin</h3>\n<p>Important region of China. The homeland of pandas. Sichuan is flat area and very good farmland. In ancient times it was hard to get there. The culture in Sichuan Basin is different from the other parts due to its isolated location. During the war time, the mountains protect people.</p>\n<h3>4. North West</h3>\n<p>Harsh weather, high mountains, deeply cut valleys. The area is not very populated. In the ancient times, criminals would be sent there as punishment.</p>\n<hr>\n<p>Chinese describe people living outside of China proper as Di, Yi, Man, Rong (N, E, S, W respectively). Basically each term means \"barbarian\". Chinese see themselves as civilized because of writing, unlike those \"barbarians\". There's very little information about the development of writing system.</p>\n<p>China proper is defined by the two rivers: Yellow River and Yangtze River. Both of the rivers flow from East to West.</p>\n<h3>Yellow River</h3>\n<p>Flows from East to West, flowing into the sea. Yellow river is called \"yellow\" because lots of the sud (?). Yellow river mouth caused lots of floods, therefore controlling the river means dealing with a lot of natural disasters. However, in the Tibet, the origin of Yellow River, the water is clear, so the river isn't always actually yellow.</p>\n<blockquote>\n<p>Need to know location and the shape for the tests.</p>\n</blockquote>\n<h3>Yangtze (Chang-Jiang) River</h3>\n<p>In Chinese called Chang-Jiang, \"long\" river. Also flows from East to West. The scenery along the river has changed due to the construction of dam(s) (?).</p>\n<blockquote>\n<p>(Assuming) Need to know location and the shape for the tests.</p>\n</blockquote>\n<h2>Chinese Population</h2>\n<p>China is a multi-ethnic country. <strong>The Han People</strong> is the majority of chinese people. Other 55 ethnic groups - 5% of the population.</p>\n<hr>\n<h2>Early Chinese Civilization</h2>\n<p>Early human ancestors are found in China. For example, <strong>Peking Man</strong>. The fossils of the Peking Man were found in the caves near the Beijing (Peking). Similar fossils were founds in far West of China. 40,000 yrs ago, Homo Sapiens fossils were found in China, showing there were people coming out of China as well (?).</p>\n<p>About 12,000 years ago, important development takes place in Ancient China. This development is domestication of grain - <strong>rice</strong>. (Not all chineese/asians like rice, north ppl prefer flour food to rice.) Earliest evidence of rice farming could be found in <strong>Jiangsu province</strong>.</p>\n<p>The domestication of rice brings shift from hunting to cultivation of crops that keeps people located in the same spot - <strong>emergence of villages</strong>. Emerges of villages marks the beginning of new lifestyle - sedimentary lifestyle, ppl stay in villages for years.</p>\n<p>Early civilization lives along the river valleys, specifically along the Yellow River valley.</p>\n<h3>Yellow River Settlements</h3>\n<p>This civilization can be specified by the pottery. How the pottery was made, we can tell the history of the group of people that lived there. They provide us with clues about such early civilization.</p>\n<h3>Yangshao Culture</h3>\n<p>Located in the (north-)west, primarily Shannxi and Gansu provice. It is dated from around 5000 BC to 3000 BC.</p>\n<p>Yangshao villages and dwellings were built by digging a rounded rectangular pit a few feet deep. Judging by the graves, there was some hierarchy in the culture. Wealthy people were buried with their possessions. Emerging society has women leadership.</p>\n<h3>Longshan Culture</h3>\n<p>Literally means Dragon Mountain. Located in the middle and lower Yellow River valley areas of northern China from about 3000 to 1900 BC, what is now Shandong province. Longshan culture is sometimes referred to as <strong>Black Pottery Culture</strong>.</p>\n<p><span\n      class=\"gatsby-resp-image-wrapper\"\n      style=\"position: relative; display: block; margin-left: auto; margin-right: auto;  max-width: 650px;\"\n    >\n      <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/0bfb5461e4215a4b6c1aed0e5ffeb836/571ad/geo-population-1.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-background-image\"\n    style=\"padding-bottom: 66.57142857142857%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDBP/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIQAxAAAAG6LlN5El//xAAaEAACAwEBAAAAAAAAAAAAAAABAgADERIh/9oACAEBAAEFAnZcWxSN2WIIi9AeD//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABgQAAMBAQAAAAAAAAAAAAAAAAABERAh/9oACAEBAAY/Aoxdylef/8QAGhAAAgMBAQAAAAAAAAAAAAAAAAERITFBcf/aAAgBAQABPyFaRE0dyELLBmX1FpbwWqW/T//aAAwDAQACAAMAAAAQE8//xAAVEQEBAAAAAAAAAAAAAAAAAAABEP/aAAgBAwEBPxAn/8QAFhEBAQEAAAAAAAAAAAAAAAAAAAER/9oACAECAQE/EK1//8QAGxABAQEAAwEBAAAAAAAAAAAAAREAIUFRMZH/2gAIAQEAAT8Qe88Re4YZQMCOCFa9JjBKCg/L7ioY6khevzIHG9rnf//Z'); background-size: cover; display: block;\"\n  ></span>\n  <img\n        class=\"gatsby-resp-image-image\"\n        alt=\"Longshan Black Pottery\"\n        title=\"Longshan Black Pottery\"\n        src=\"/static/0bfb5461e4215a4b6c1aed0e5ffeb836/53025/geo-population-1.jpg\"\n        srcset=\"/static/0bfb5461e4215a4b6c1aed0e5ffeb836/e7722/geo-population-1.jpg 163w,\n/static/0bfb5461e4215a4b6c1aed0e5ffeb836/bdb37/geo-population-1.jpg 325w,\n/static/0bfb5461e4215a4b6c1aed0e5ffeb836/53025/geo-population-1.jpg 650w,\n/static/0bfb5461e4215a4b6c1aed0e5ffeb836/571ad/geo-population-1.jpg 700w\"\n        sizes=\"(max-width: 650px) 100vw, 650px\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;\"\n        loading=\"lazy\"\n      />\n  </a>\n    </span></p>\n<p>The pottery in Longshan isn't as decorated as in Yangshao.</p>\n<p>Longshan culture dominated the North of Yellow river. (?)</p>\n<h3>Liangzhu Culture</h3>\n<p>Located in <strong>Jiangsu province</strong>, in the Yangtze River Delta of China, around 2500 BC.</p>\n<h3>Sanxingdui Culture</h3>\n<p>Located in <strong>Sichuan Province</strong>, around 1600-221 BC.</p>\n<blockquote>\n<p>\"The discovery at Sanxingdui, as well as other discoveries such as the Xingan tombs in Jiangxi, challenges the traditional narrative of Chinese civilization spreading from the central plain of the Yellow River, and Chinese archaeologists have begun to speak of multiple centers of innovation jointly ancestral to Chinese civilization.\" <a href=\"https://en.wikipedia.org/wiki/Sanxingdui\">wiki/Sanxingdui</a></p>\n</blockquote>","frontmatter":{"date":"January 14, 2020","title":"Chinese Civilization: Intro","description":"Geographical features & population","published":true},"fields":{"slug":"/options/chin317/geo-population","category":"options"}}},{"node":{"id":"5afcfabd-fdb7-5656-9cf9-c4ef3f7639f4","html":"<h2>What is Geogrpahy</h2>\n<ul>\n<li>Study of earth</li>\n<li>Spatial science</li>\n<li>\n<p>Study of spatial variation</p>\n<ul>\n<li>looking at impacts of climate change</li>\n<li>agriculture</li>\n</ul>\n</li>\n</ul>\n<p>Geography - the original science. Has fluctuated in it's percieved importance in\nscience over history.\nAn extremely fragmented discipline, often considered too broad to be coheisive.\nMain purpose to interpret relationships in space of both in physical and human environments.\nMany other disciplines have evolved from Geography.</p>\n<h3>Geography's Niche</h3>\n<p>Geogrpahy is both a physical and a social science.\nGeography looks at many grey areas between the physical and human environment.\nTherefore the same subject matter is often studied from both the human and physical perspective. e.g. pollution - focuses on physical @TODO.</p>","frontmatter":{"date":"January 13, 2020","title":"Intro: Society And Environment","description":"","published":false},"fields":{"slug":"/options/geog254/intro","category":"options"}}}]}}}