{"data":{"markdownRemark":{"html":"<p>Computer security focuses on three fundamental questions:</p>\n<ul>\n<li>What assets are we protecting?</li>\n<li>How are those assets threatened?</li>\n<li>What can we do to counter those threats?</li>\n</ul>\n<h2>Security for Individuals</h2>\n<p>Information security we want/expect from our personal computers and devices</p>\n<ul>\n<li>Our private data is not seen by others, and we want to define what 'others' means.</li>\n<li>Our data remains unchanged</li>\n<li>\n<p>We can access our data when we want</p>\n<ul>\n<li>Access is important</li>\n</ul>\n</li>\n</ul>\n<p>Therefore, we want <strong>c</strong>onfidentiality + <strong>i</strong>ntegrity + <strong>a</strong>vialability = CIA (lol).</p>\n<h3>Example</h3>\n<p>Given a company, what will require protection? From what/whom?</p>\n<p><strong>Confidentiality</strong>:</p>\n<ul>\n<li>Stored data</li>\n<li>Communication (data in-flight)</li>\n</ul>\n<p><strong>Integrity</strong>:</p>\n<ul>\n<li>All stored data, all communication</li>\n</ul>\n<h2>Computer Security Overview</h2>\n<p>The NIST defines the term <strong>Computer Security</strong> as</p>\n<blockquote>\n<p>The protection afforded to an automated information system in order to attain the applicable objectives of preserving the integrity, availability and confidentiality of information system resources.</p>\n</blockquote>\n<p>That includes hardware, software, firmware, information/data, and telecommunications.</p>\n<h3>Key Security Concepts</h3>\n<p><strong>Confidentiality</strong>:</p>\n<ul>\n<li>Preserving authorized restriction on information access and disclose, including means for protecting personal privacy and proprietary information.</li>\n</ul>\n<p><strong>Integrity</strong>:</p>\n<ul>\n<li>Guarding against improper information modification or destruction, including ensuring information nonrepudiation and authenticity.</li>\n</ul>\n<p><strong>Availability</strong>:</p>\n<ul>\n<li>Ensuring timely and reliable access to, and use of, information.</li>\n</ul>\n<p>Computer security is both fascinating and complex. Requirements seem straightforward, but the mechanisms used to meet those requirements can be complex and subtle. When developing a security mechanisms, one must always consider potential attacks (often unexpected) on such mechanism. Procedures used to provide particular services are often counter-intuitive. It is necessary to decide where to use which security mechanisms (both logical &#x26; physical). Security mechanisms typically involve more than a particular algorithm or protocol, but also require participants to have secret information, leading to issues of creation, distribution, and protection of that secret information.</p>\n<p>Computer security is essentially a battle between perpetrator who tries to find weaknesses and the designer or administrator who tries to close them. Attackers only need to find a single weakness, whereas the developer needs to find all the weaknesses. Many users percieve little benefit from security investment until a failure occurs.</p>\n<p>Security requires regular monitoring which is difficult in today's short term environment. Unfortunately, security is still too often an afterthought - incorpotated after the design is complete. <strong>Security is a process, never a finished product</strong>.</p>\n<h3>Terminology</h3>\n<ul>\n<li><strong>adversary</strong> or <strong>threat agent</strong> - an entity that attacks, or threats to, a system</li>\n<li><strong>attack</strong> - an assault on system security that derives from an intelligent threat; a deliberate attempt to evade security services and violate security policy of a system</li>\n<li><strong>countermeasure</strong> - </li>\n<li><strong>risk</strong>: an expectation of loss expressed as the probability that a particular threat will exploit a particular vulnerability with a particular harmful result</li>\n<li><strong>security policy</strong> - a set of rules and practices that specifies how a system or organization provides security services to protect sensitive and critical system resources</li>\n<li><strong>system resource</strong> or <strong>asset</strong> - </li>\n<li><strong>threat</strong> - a potential for violation of security, which exists when there is a circumstance, capability, or action that could breach security and cause harm.</li>\n<li><strong>vulnerability</strong> - </li>\n</ul>\n<h4>Concepts and their relationships</h4>\n<!--todo: image-->\n<h3>Vulnerability, Threats and Attacks</h3>\n<p>General vulnerability categories:</p>\n<ul>\n<li>Corrupted - e.g. does the wrong thing, stores the wrong data (loss of integrity)</li>\n<li>Leaky - revealing partial information (loss of confidentiality)</li>\n<li>Unavailable or very slow - system gets slow &#x26; overwhelmed (loss of availability)</li>\n</ul>\n<p>Threats:</p>\n<ul>\n<li>Represent potential security harm</li>\n</ul>\n<p>Attacks</p>\n<ul>\n<li>Attacks are threats carried out</li>\n<li>Passive or active attempts to alter/affect system resources</li>\n</ul>\n<h3>Countermeasures</h3>\n<p>Countermeasures are actions taken to mitigate or deal with an attack.</p>\n<ul>\n<li>prevention</li>\n<li>detection/response</li>\n<li>recovery</li>\n<li>\n<p>residual vulnerabilities - countermeasures can introduce new vulnerability (e.g. Spectre vulnerability)</p>\n<ul>\n<li>Goal is to minimize residuals</li>\n</ul>\n</li>\n</ul>\n<h3>Outside and Inside Attacks</h3>\n<p>Who carries out attack?</p>\n<p><strong>Insider</strong>:</p>\n<ul>\n<li>Someone authorized to use the system</li>\n<li>Disgruntled employee?</li>\n</ul>\n<p><strong>Outsider</strong>:</p>\n<ul>\n<li>Someone who is not authorized to use the system</li>\n</ul>\n<h3>Threat Consqeuences</h3>\n<h4>Unauthorized disclousure</h4>\n<p>A circumstance or event whereby an entity gains access to data for which the entity is not authorized.</p>\n<p><strong>Unauthorized disclosure</strong> is a threat to confidentiality.</p>\n<ul>\n<li>Exposure</li>\n<li>Interception</li>\n<li>Inference</li>\n<li>Intrusion</li>\n</ul>\n<h4>Deception</h4>\n<p>A circumstance or event may result in an authorized entity receiving false data and believing it to be true.</p>\n<p><strong>Deception</strong> is a threat to either system or data integrity.</p>\n<ul>\n<li>Masquerade</li>\n<li>Falsification</li>\n<li>Repudiation</li>\n</ul>\n<h4>Disruption</h4>\n<p>A circumstance or event that interrupts or prevents the correct operation of system services and functions.</p>\n<p><strong>Disruption</strong> is a threat to availability or system integrity.</p>\n<ul>\n<li>Incapacitation</li>\n<li>Corruption</li>\n<li>Obstruction</li>\n</ul>\n<h4>Ususrpation</h4>\n<p>A circumstance or event that results in control of system services or functions by an unauthorized entity.</p>\n<p><strong>Usurpation</strong> is a threat to system integrity.</p>\n<ul>\n<li>Misappropriation</li>\n<li>Misuse</li>\n</ul>","frontmatter":{"date":"January 14, 2019","title":"Overview & Terminology","tags":["cpsc329"]}}},"pageContext":{"prev":{"fields":{"slug":"/cpsc413/lec1-stable-matching"},"frontmatter":{"published":false,"tags":["cpsc413"]}},"slug":"/cpsc329/lec1-overview-terminology","next":{"fields":{"slug":"/cpsc441/lec1-introduction"},"frontmatter":{"published":false,"tags":["cpsc441"]}},"category":"cpsc329"}}