{"data":{"markdownRemark":{"html":"<h2>Defining an OS</h2>\n<p>There's no 'precise' definition. It is a layer of software that provides application programs with a better, simpler, cleaner model of the computer. The OS is there to simplify interaction with the hardware. OS manages all resources.</p>\n<p>It is the software that runs all the time (mostly in kernel mode). All other applications need it in order to run (<em>most</em> applications will need it).</p>\n<p>We can look at an OS from two different perspectives:</p>\n<ul>\n<li>an <strong>extended machine</strong></li>\n<li>as a <strong>resource manager</strong></li>\n</ul>\n<p>An OS presents an abstraction mechanism that lets you interact with the hardware.</p>\n<h3>OS - an extended machine</h3>\n<p>Abstraction / generalization is key to managing complexity. First we define and implement the abstractions. For example, files - working with files is easier than dealing with raw disk space. Then, using these abstractions, we write applications and solve problems (e.g. file editor, image viewer). An OS doesn't care what's in the file, it is up to the applications to determine how to use the file.</p>\n<p>The abstractions allow us to mask the ugly hardware and provide nice interfaces instead. Many OS concepts are abstractions, therefore there are some similarities to OOP.</p>\n<h3>OS - a resource manager</h3>\n<p>OS acts as a resource allocator. It multiplexes available resources.</p>\n<ul>\n<li>\n<p>Multiplexing resources in time</p>\n<ul>\n<li>e.g. 3 programs trying to print to the same printer (spooling)</li>\n<li>e.g. 2 programs trying to run at the same time (scheduling)</li>\n</ul>\n</li>\n<li>\n<p>Multiplexing resources in space</p>\n<ul>\n<li>e.g. 2 programs allocating memory</li>\n</ul>\n</li>\n</ul>\n<p>OS manages conflics among multiple programs or users.</p>\n<!--IMPORTANT: syscalls need to be checked-->\n<p>We can also think about OS as a control program. It decides when to run which application. OS monitors improper use and prevents errors. OS is responsible for handling all interrupts and traps.</p>\n<h2>History of Operating Systems</h2>\n<p>OSes often developed by customers instead of HW manufacturers. IBM developed first OS in the 60's.</p>\n<h3>First Generation (1945 - 1955): Vacuum Tubes and no OS</h3>\n<p>Programs were hardwired, later were made on punch cards. Programs were written in machine language. Hardware required complicated wiring. Only single user at a time. Such computers were only able to perform basic calculations. No OS since there was no need for one.</p>\n<h3>Second Generation (1955 - 1965): Transistors and Batch Systems</h3>\n<p>Transistor based mainframe computers replaced old vacuum tube computers. Programs were made with FORTRAN &#x26; COBOL. OSes that were used: FMS (Fortran Monitor System) and IBSYS (IBM OS). Important concept was introduced: <strong>batch systems</strong>.</p>\n<h4>Batch Systems</h4>\n<p>The users of a batch operating system do not interact with the computer directly. Each user prepares his job on an off-line device like punch cards and submits it to the computer operator. To speed up processing, jobs with similar needs are batched together and run as a group. The programmers leave their programs with the operator and the operator then sorts the programs with similar requirements into batches.</p>\n<h3>Third Generation (1965 - 1980): ICs and Multiprogramming</h3>\n<p>Transistors were replaces with Integrated Circuits (ICs). Lots of OSes came out: IBM OS/360, CTSS (by MIT), MULTICS (complicated, but influential), UNIX (inspired by MULTICS). Important concepts:</p>\n<ul>\n<li><strong>multiprogramming</strong>: a different job in each memory partition, CPU execute other jobs, while waiting for the IO of some jobs. Multiple programs could sit in memory.</li>\n<li><strong>spooling</strong> (Simultaneous Peripheral Operation On Line): read jobs from cards to disk, load jobs from disk automatically, no more tapes.</li>\n<li><strong>time-sharing</strong>: multiple users using one computer simultaneously and interactively. Terminals were connected to a central server.</li>\n</ul>\n<h4>Multiprogramming</h4>\n<p>Refers to the idea, if you have more than one program in the memory, processor will switch between the programs when one program is idle.</p>\n<h4>Spooling</h4>\n<p>Spooling is typically used to deal with slow devices/peripherals, e.g. printer. Spooling can be used to deal (somewhat) with deadlocks in concurrent programming.</p>\n<h3>Fourth Generation (1990 - Now): Personal Computers</h3>\n<p>Cheap, mass-produced computers, User friendly interfaces on top of OS.</p>","frontmatter":{"date":"January 15, 2019","title":"Operating Systems: Introduction, History, Basic Concepts","tags":["cpsc457"]}}},"pageContext":{"prev":{"fields":{"slug":"/cpsc441/lec1-introduction"},"frontmatter":{"published":true,"tags":["cpsc441"]}},"slug":"/cpsc457/lec1-basic-concepts","next":{"fields":{"slug":"/cpsc329/lec2-passwords-auth"},"frontmatter":{"published":true,"tags":["cpsc329"]}},"category":"cpsc457"}}